brew 'gnu-sed'
brew 'gawk'
brew 'coreutils'
brew 'tmux'
brew 'vim'
brew 'zsh'
brew 'autojump'
brew 'ag'
brew 'rbenv'
brew 'readline'
brew 'ruby-build'
brew 'tig'
brew 'hub'
brew 'reattach-to-user-namespace'
brew 'jq'

tap 'peco/peco'
brew 'peco'

brew 'cscope'
brew 'lua'

tap 'splhack/homebrew-splhack'
brew 'cmigemo-mk', args: ['HEAD']
brew 'ctags-objc-ja', args: ['HEAD']

# brew 'macvim-kaoriya', args: ['HEAD', 'with-lua', 'with-cscope']
tap 'caskroom/homebrew-versions'
cask 'macvim-kaoriya'

brew 'caskroom/cask/brew-cask'
cask 'karabiner'
cask 'firefox'
cask 'google-chrome'
cask 'dropbox'
cask 'scansnap-manager-ix500'

# totalterminal later
# cask totalterminal
